AxDen-Dev/NRF52_3_Axis_Livestock_Motion_Tracker_example/main.c
}

void read_battery_level_temperature(void) {

	if (m_saadc_initialized == 0x00) {

		saadc_init();

	}

	m_saadc_initialized = 0x01;

	nrf_drv_saadc_sample();

}

static void twi_scan(void) {

	NRF_LOG_INFO("I2C Scan started.");
	NRF_LOG_FLUSH();

	for (uint16_t i = 0; i < 127; i++) {

		uint8_t reg = 0x01;
		uint8_t twi_timeout = 5;

		twi_write_done = 0x00;
		twi_read_done = 0x00;
		twi_address_nack = 0x00;

		nrf_drv_twi_tx(&m_twi, i, &reg, 1, false);

		while (!twi_write_done && --twi_timeout) {

			idle_state_handle();

		}

		if (!twi_address_nack) {

			NRF_LOG_INFO("FIND %02X", i);

		}

		NRF_LOG_FLUSH();

	}

}

static void twi_handler(nrf_drv_twi_evt_t const *p_event, void *p_context) {

	switch (p_event->type) {

	case NRF_DRV_TWI_EVT_DONE:

		twi_write_done = 0x01;
		twi_read_done = 0x01;

		break;

	default:
//	    NRF_DRV_TWI_EVT_ADDRESS_NACK,
//	    NRF_DRV_TWI_EVT_DATA_NACK

		twi_write_done = 0x01;
		twi_read_done = 0x01;
		twi_address_nack = 0x01;

		break;

	}

}

static void twi_init(void) {

	ret_code_t err_code;

	const nrf_drv_twi_config_t twi_config =
			{ .scl = I2C_SCL_GPIO, .sda = I2C_SDA_GPIO, .frequency =
					NRF_DRV_TWI_FREQ_400K, .interrupt_priority =
					APP_IRQ_PRIORITY_HIGH, .clear_bus_init = false };

	err_code = nrf_drv_twi_init(&m_twi, &twi_config, twi_handler, NULL);
	APP_ERROR_CHECK(err_code);

	nrf_drv_twi_enable(&m_twi);

}

static void kxtj3_init() {

	uint8_t twi_timeout = 0;

	uint8_t reg[2];

	//software reset
	reg[0] = 0x1D;
	reg[1] = (1 << 7);

	twi_timeout = TWI_TIMEOUT_COUNT;
	twi_write_done = 0x00;
	twi_address_nack = 0x00;

	nrf_drv_twi_tx(&m_twi, KXTJ3_ADDRESS, reg, 2, false);

	while (!twi_write_done && --twi_timeout) {

		idle_state_handle();

	}

	//Wait 300ms
	for (uint8_t i = 0; i < 3; i++) {

		idle_state_handle();

	}

	reg[0] = 0x1B;
	reg[1] = 0b00000000;

	twi_timeout = TWI_TIMEOUT_COUNT;
	twi_write_done = 0x00;
	twi_address_nack = 0x00;

	nrf_drv_twi_tx(&m_twi, KXTJ3_ADDRESS, reg, 2, false);

	while (!twi_write_done && --twi_timeout) {

		idle_state_handle();

	}

	//Wait 300ms
	for (uint8_t i = 0; i < 3; i++) {

		idle_state_handle();

	}

	reg[0] = 0x21;
	reg[1] = 0x00;

	twi_timeout = TWI_TIMEOUT_COUNT;
	twi_write_done = 0x00;
	twi_address_nack = 0x00;

	nrf_drv_twi_tx(&m_twi, KXTJ3_ADDRESS, reg, 2, false);

	while (!twi_write_done && --twi_timeout) {

		idle_state_handle();

	}

	reg[0] = 0x1F;
	reg[1] = 0x00;

	twi_timeout = TWI_TIMEOUT_COUNT;
	twi_write_done = 0x00;
	twi_address_nack = 0x00;

	nrf_drv_twi_tx(&m_twi, KXTJ3_ADDRESS, reg, 2, false);

	while (!twi_write_done && --twi_timeout) {

		idle_state_handle();

	}

	reg[0] = 0x1B;
	reg[1] = 0b10000000;

	twi_timeout = TWI_TIMEOUT_COUNT;
	twi_write_done = 0x00;
	twi_address_nack = 0x00;

	nrf_drv_twi_tx(&m_twi, KXTJ3_ADDRESS, reg, 2, false);

	while (!twi_write_done && --twi_timeout) {

		idle_state_handle();

	}

}

static uint16_t get_kxtj3_vector(int16_t *ax, int16_t *ay, int16_t *az) {

	uint8_t twi_timeout = 0;

	uint8_t reg = 0x06;
	uint8_t buffer[6] = { 0x00 };

	twi_timeout = TWI_TIMEOUT_COUNT;
	twi_write_done = 0x00;
	twi_address_nack = 0x00;

	nrf_drv_twi_tx(&m_twi, KXTJ3_ADDRESS, &reg, 1, false);

	while (!twi_write_done && --twi_timeout) {

		idle_state_handle();

	}

	twi_timeout = TWI_TIMEOUT_COUNT;
	twi_read_done = 0x00;
	twi_address_nack = 0x00;

	nrf_drv_twi_rx(&m_twi, KXTJ3_ADDRESS, buffer, 6);

	while (!twi_read_done && --twi_timeout) {

		idle_state_handle();

	}

	int8_t value = buffer[1];
	*ax = value * SCALE_VALUE;

	value = buffer[3];
	*ay = value * SCALE_VALUE;

	value = buffer[5];
	*az = value * SCALE_VALUE;

	NRF_LOG_INFO("AX %d, AY %d, AZ %d", *ax, *ay, *az);

	float vector = powf(*ax, 2);
	vector += powf(*ay, 2);
	vector += powf(*az, 2);
	vector = sqrtf(vector);

	uint16_t output_vector = (uint16_t) roundf(vector);

	return output_vector;

}

static void gpio_init() {

	nrf_gpio_cfg_output(NTC_VCC_GPIO);
	nrf_gpio_pin_clear(NTC_VCC_GPIO);

	nrf_gpio_cfg_output(LED_RED_GPIO);
	nrf_gpio_pin_clear(LED_RED_GPIO);

	nrf_gpio_cfg_output(LED_BLUE_GPIO);
	nrf_gpio_pin_clear(LED_BLUE_GPIO);

	nrf_gpio_cfg_input(HALL_INPUT_GPIO, NRF_GPIO_PIN_NOPULL);

}

/**@brief Function for application main entry.
 */
int main(void) {

	int16_t ax = 0;
	int16_t ay = 0;
	int16_t az = 0;

	int16_t max_ax = 0;
	int16_t max_ay = 0;
	int16_t max_az = 0;
	uint32_t vector_max = 0;

	uint16_t on_off_count = 0;

	uint8_t temperature_read_step = 0x00;

	uint32_t device_id_0 = NRF_FICR->DEVICEID[1];
	uint32_t device_id_1 = NRF_FICR->DEVICEID[0];

	mac_address[0] = device_id_0 >> 24;
	mac_address[1] = device_id_0 >> 16;
	mac_address[2] = device_id_0 >> 8;
	mac_address[3] = device_id_0;

	mac_address[4] = device_id_1 >> 24;
	mac_address[5] = device_id_1 >> 16;
	mac_address[6] = device_id_1 >> 8;
	mac_address[7] = device_id_1;

	log_init();

	timers_init();

	gpio_init();

	twi_init();

	power_management_init();

	ble_stack_init();

#ifdef NRF528XX_FEM

	fem_init();

#endif

	gap_params_init();

	gatt_init();

	services_init();

	advertising_init(data_update_state);

	conn_params_init();

	advertising_start();

	app_timer_start(m_app_timer_id, APP_TIMER_DELAY, NULL);

	get_mac_address();

	twi_scan();

	kxtj3_init();

	nrf_gpio_pin_set(NTC_VCC_GPIO);

	wait_200ms();

	read_battery_level_temperature();

	nrf_gpio_pin_clear(NTC_VCC_GPIO);

	nrf_gpio_pin_clear(LED_RED_GPIO);
	nrf_gpio_pin_clear(LED_BLUE_GPIO);

	NRF_LOG_INFO("Start main loop");

	radio_packet_protocol.Packet.company_id[0] = COMPANY_ID >> 8;
	radio_packet_protocol.Packet.company_id[1] = COMPANY_ID;

	radio_packet_protocol.Packet.device_id[0] = DEVICE_TYPE >> 8;
	radio_packet_protocol.Packet.device_id[1] = DEVICE_TYPE;

	memcpy(radio_packet_protocol.Packet.mac_address, mac_address, 8);

