AxDen-Dev/NRF52_3_Axis_Livestock_Motion_Tracker_example/main.c
	radio_packet_protocol.Packet.control_number = 0;

	for (;;) {

		if (!nrf_gpio_pin_read(HALL_INPUT_GPIO)) {

			if (on_off_state) {

				nrf_gpio_pin_clear(LED_RED_GPIO);
				nrf_gpio_pin_set(LED_BLUE_GPIO);

				on_off_count++;

			} else {

				nrf_gpio_pin_set(LED_RED_GPIO);
				nrf_gpio_pin_clear(LED_BLUE_GPIO);

				on_off_count++;

			}

			if (on_off_count > 10) {

				if (on_off_state) {

					data_update_state = 0x00;

					adversting_stop();

					gap_params_init();

					advertising_init(data_update_state);

					advertising_start();

					nrf_gpio_pin_clear(NTC_VCC_GPIO);

				}

				temperature_read_step = 0x00;

				vector_max = 0;

				nrf_gpio_pin_clear(LED_RED_GPIO);
				nrf_gpio_pin_clear(LED_BLUE_GPIO);

				for (uint8_t i = 0; i < 10; i++) {

					while (!app_timer_update) {

						idle_state_handle();

					}

					app_timer_update = 0x00;

				}

				nrf_gpio_pin_set(LED_RED_GPIO);
				nrf_gpio_pin_set(LED_BLUE_GPIO);

				on_off_state = !on_off_state;

				on_off_count = 0;

			}

		} else {

			nrf_gpio_pin_set(LED_RED_GPIO);
			nrf_gpio_pin_set(LED_BLUE_GPIO);

			on_off_count = 0;

		}

		if (on_off_state) {

			uint32_t vector = get_kxtj3_vector(&ax, &ay, &az);

			if (vector > vector_max) {

				max_ax = ax;
				max_ay = ay;
				max_az = az;
				vector_max = vector;

			}

			if (collection_cycle_update) {

				if (temperature_read_step == 0x00) {

					nrf_gpio_pin_set(NTC_VCC_GPIO);

					temperature_read_step = 0x01;

				} else {

					read_battery_level_temperature();

					nrf_gpio_pin_clear(NTC_VCC_GPIO);

					payload_size = 0;
					memset(payload, 0x00, sizeof(payload));

					payload_size = sprintf((char*) payload, "%d.%d,",
							(battery_value / 10), (battery_value % 10));

					payload_size += sprintf((char*) payload + payload_size,
							"%d.%d,", (temperature / 10),
							abs(temperature % 10));

					payload_size += sprintf((char*) payload + payload_size,
							"%d,", max_ax);

					payload_size += sprintf((char*) payload + payload_size,
							"%d,", max_ay);

					payload_size += sprintf((char*) payload + payload_size,
							"%d", max_az);

					radio_packet_protocol_size = PACKET_HEADER_SIZE;
					radio_packet_protocol_size += payload_size;
					memcpy(radio_packet_protocol.Packet.payload, payload,
							payload_size);

					temperature_read_step = 0x00;
					collection_cycle_update = 0x00;

					if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {

						adversting_stop();

						gap_params_init();

						advertising_init(data_update_state);

						advertising_start();

					}

					vector_max = 0;

					data_update_state = 0x01;

					NRF_LOG_INFO("Data Update");

				}

			}

			if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {

				if (aggregator_notify_enable_state) {

					if (data_update_state) {

						if (tx_complete_state == 0x01) {

							tx_complete_state = 0x00;

							ble_service_send_aggregator_notification(
									m_conn_handle, &m_service,
									radio_packet_protocol.buffer,
									radio_packet_protocol_size);

							data_update_state = 0x00;

							NRF_LOG_INFO("Aggregator notify send");

						} else if (tx_complete_state == 0x02) {

							disconnect_timeout_count = DISCONNECT_TIMEOUT;

						}

					}

				} else if (stream_notify_enable_state) {

					if (data_update_state) {

						if (tx_complete_state) {

							tx_complete_state = 0x00;

							ble_service_send_stream_notification(m_conn_handle,
									&m_service, radio_packet_protocol.buffer,
									radio_packet_protocol_size);

							data_update_state = 0x00;

							NRF_LOG_INFO("Stream notify send");

						}

					}

					disconnect_timeout_count = 0;

				}

				disconnect_timeout_count++;

				if (disconnect_timeout_count > DISCONNECT_TIMEOUT) {

					if (request_disconnect == 0x00) {

						sd_ble_gap_disconnect(m_conn_handle,
						BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

						request_disconnect = 0x01;

						NRF_LOG_INFO("Disconnect request");

					}

				}

			} else {

				disconnect_timeout_count = 0;

			}

		}

		while (!app_timer_update) {

			idle_state_handle();

		}

		app_timer_update = 0x00;

		NRF_LOG_FLUSH();

	}
}

/**
 * @}
 */
